import 'dart:io';

void main() {
  double balance = 5000.0;

  // Вечный двигатель для меню: стоим тут постоянно, пока юзер не решит выйти
  while (true) {
    print('\ МЕНЮ БАНКОМАТА ');
    print('1. Проверить баланс');
    print('2. Пополнить счет');
    print('3. Снять наличные');
    print('4. Выход');
    stdout.write('Выберите пункт меню: ');

    // понимаем то, что напечатал юзер с клавиатуры
    String? input = stdin.readLineSync();
    
    // Пытаемся превратить текст в нормальную цифру
    int? choice = int.tryParse(input ?? ''); //tryParse — это безопасный переводчик из текста в число, дальше мы будем использовать его
    // Если вместо цифры напечатали буквы или вообще пустоту — ругаемся и кидаем в начало меню
    if (choice == null) {
      print('Ошибка: нужно ввести цифру от 1 до 4, а не буквы!');
      continue; // Откидывает обратно наверх к началу меню
    }

    // Смотрим, какую цифру выбрал юзер, и делаем нужное дело
    switch (choice) {
      case 1:
        // Выводим остаток на экране
        print('Ваш баланс: $balance сомов');
        break;

      case 2:
        // Просим ввести сумму, которую хочется закинуть
        stdout.write('Введите сумму для пополнения: ');
        String? amountInput = stdin.readLineSync();
        double? amount = double.tryParse(amountInput ?? '');
        
        // Если ввели чепуху (отрицательное число или буквы) — шлем лесом и сбрасываем шаг
        if (amount == null || amount <= 0) {
          print('Ошибка: так пополнять нельзя, введите нормальную сумму.');
          continue;
        }
        
        // Накидываем деньги на счет
        balance += amount;
        print('Красавчик, счет пополнен. Теперь у тебя: $balance сомов');
        break;

      case 3:
        // Спрашиваем, сколько нужно обналичить
        stdout.write('Введите сумму для снятия: ');
        String? withdrawInput = stdin.readLineSync();
        double? withdrawAmount = double.tryParse(withdrawInput ?? '');
        
        // Проверка на дурака (вдруг ввели минус или буквы)
        if (withdrawAmount == null || withdrawAmount <= 0) {
          print('Ошибка: некорректная сумма.');
          continue;
        }
        
        // Проверяем, не пытается ли снять больше, чем есть в кармане
        if (withdrawAmount > balance) {
          print('Ошибка: у тебя столько нет! Багатей нашлись.');
          continue;
        }
        
        // Забираем деньги со счета
        balance -= withdrawAmount;
        print('Деньги выданы. На счету осталось: $balance сомов');
        break;

      case 4:
        // Говорим пока-пока и полностью вырубаем прогу
        print('Спасибо за использование нашего банкомата. До свидания!');
        return; // это команда означает «Стоп, всё закончено».

      default:
        // Если ввели цифру, которой нет в списке (например, 9)
        print('Ошибка: нет такого пункта. Выбирай от 1 до 4!');
    }
  }
}